package Homework_6.Student;

import java.util.ArrayList;
import java.util.List;

public class StudentRunner {
    // Напишите класс Student, предоставляющий информацию об имени студента методом getName() и о его курсе методом getCourse().
    // Напишите метод printStudents(List students, int course), который получает список студентов и номер курса и печатает в консоль
    // имена тех студентов из списка, которые обучаются на данном курсе. Для обхода списка в этом методе используйте итератор.
    //Протестируйте ваш метод (для этого предварительно придется создать десяток объектов класса Student и поместить их в список).

    public static void main(String[] args) {
        List <Student> students = new ArrayList <Student>();


  /*  public static void printStudents(List<Student> students, int course) {
        System.out.println("Список студентов " + course + " курса:");
        for (int i = 0; i < students.size(); i++) {
            if ( course == students.get(i).course) {
                System.out.println(students.get(i).surname + " " + students.get(i).name + " " + students.get(i).patronymic);
            }
        }*/
    }
}

